kbonset/openwsn-fw/bsp/boards/samd21_xpro/drivers/inc/samd21_radio.h
/**
* Copyright (c) 2014 Atmel Corporation. All rights reserved. 
*  
* Redistribution and use in source and binary forms, with or without 
* modification, are permitted provided that the following conditions are met:
* 
* 1. Redistributions of source code must retain the above copyright notice, this
* list of conditions and the following disclaimer.
* 
* 2. Redistributions in binary form must reproduce the above copyright notice, 
* this list of conditions and the following disclaimer in the documentation 
* and/or other materials provided with the distribution.
* 
* 3. The name of Atmel may not be used to endorse or promote products derived 
* from this software without specific prior written permission.  
* 
* 4. This software may only be redistributed and used in connection with an 
* Atmel microcontroller product.
* 
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE 
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE 
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE 
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR 
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE 
* GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) 
* HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, 
* STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY 
* OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
* 
* 
* 
*/

#ifndef samd21_radio_h__
#define samd21_radio_h__

#include "base_type.h"
#include "samd21_gpio.h"

/* 
	This file is placeholder for radio connection
	and its definitions
*/
#define RF_IRQ_MODULE           EIC
#define RF_IRQ_INPUT            4
#define RF_IRQ_PIN              PIN_PB04A_EIC_EXTINT4
#define RF_IRQ_MUX              MUX_PB04A_EIC_EXTINT4
#define RF_IRQ_PINMUX           PINMUX_PB04A_EIC_EXTINT4

/* 
	Configure the SAMD21 extensions pins 
	used to connect the AT86RFX Radio pins 
*/
#define AT86RFX_RST_PIN              PIN_PB02
#define AT86RFX_IRQ_PIN              PIN_PB04
#define AT86RFX_SLP_PIN              PIN_PB05
#define AT86RFX_SPI_CS				 PIN_PA05
#define AT86RFX_SPI_MOSI             PIN_PA06
#define AT86RFX_SPI_MISO             PIN_PA04
#define AT86RFX_SPI_SCK              PIN_PA07

/* 
	Configure the SAMD21 Control pins 
	used to contro the AT86RFX Radio 
*/
#define RST_HIGH()                      port_pin_set_level(AT86RFX_RST_PIN, true)
#define RST_LOW()                       port_pin_set_level(AT86RFX_RST_PIN, false)
#define SLP_TR_HIGH()                   port_pin_set_level(AT86RFX_SLP_PIN, true)
#define SLP_TR_LOW()                    port_pin_set_level(AT86RFX_SLP_PIN, false)
#define IRQ_PINGET()                    port_pin_get_input_level(AT86RFX_IRQ_PIN)

#endif // samd21_radio_h__
